---
kind: method
id: M:Autodesk.Revit.DB.TableCellCombinedParameterData.Dispose
source: html/dedced9d-ad99-2d0a-dea4-4cd82d036da0.htm
---
# Autodesk.Revit.DB.TableCellCombinedParameterData.Dispose Method

Releases all resources used by the TableCellCombinedParameterData

## Syntax (C#)
```csharp
public void Dispose()
```